Revit 2015 API
Panel Members
The Panel type exposes the following members.
Methods
Name | Description
AddCoping
Adds a coping (cut) to a steel beam.
 (Inherited from FamilyInstance.)
ArePhasesModifiable
 Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
 (Inherited from Element.)
CanBeHidden
Indicates if the element can be hidden in the view.
 (Inherited from Element.)
CanBeLocked
 Identifies if the element can be locked.
 (Inherited from Element.)
CanHaveAnalyticalModel
 Indicates whether the Element can have an Analytical Model.
 (Inherited from Element.)
CanHaveTypeAssigned()
 Identifies if the element can have a type assigned.
 (Inherited from Element.)
ChangeTypeId(ElementId)
 Changes the type of the element.
 (Inherited from Element.)
DeleteEntity
 Deletes the existing entity created by %schema% in the element
 (Inherited from Element.)
Dispose |  (Inherited from Element.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
FindHostPanel
 Finds the id of the host panel (i.e., wall) associated with this panel. If a host panel is present, then it is displayed instead of the curtain panel.
flipFacing
The orientation of family instance facing will be flipped. If it can not be flipped, return false, otherwise return true.
 (Inherited from FamilyInstance.)
FlipFromToRoom
 Flips the settings of "From Room" and "To Room" for the door or window instance.
 (Inherited from FamilyInstance.)
flipHand
The orientation of family instance hand will be flipped. If it can not be flipped, return false, otherwise return true.
 (Inherited from FamilyInstance.)
GetAnalyticalModel
 Retrieves writeable Analytical Model for Element.
 (Inherited from Element.)
GetAnalyticalModelId
 Retrieves the Element Id of the Analytical Model Element for this Element.
 (Inherited from Element.)
GetCopingIds
Lists the elements currently used as coping cutters for this element.
 (Inherited from FamilyInstance.)
GetEntity
 Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.
 (Inherited from Element.)
GetEntitySchemaGuids
 Returns the Schema guids of any Entities stored in this element.
 (Inherited from Element.)
GetExternalFileReference
 Gets information pertaining to the external file referenced by the element.
 (Inherited from Element.)
GetExternalResourceReference
 Gets the ExternalResourceReference associated with a specified external resource type.
 (Inherited from Element.)
GetExternalResourceReferences
 Gets the full map of the external resource references referenced by the element.
 (Inherited from Element.)
GetFamilyPointPlacementReferences
Returns the Point Placement References for the Family Instance.
 (Inherited from FamilyInstance.)
GetGeneratingElementIds
 Returns the ids of the element(s) that generated the input geometry object.
 (Inherited from Element.)
GetGeometryObjectFromReference
 Retrieve one geometric primitive contained in the element given a reference.
 (Inherited from Element.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetMaterialArea
 Gets the area of the material with the given id.
 (Inherited from Element.)
GetMaterialIds
 Gets the element ids of all materials present in the element.
 (Inherited from Element.)
GetMaterialVolume
 Gets the volume of the material with the given id.
 (Inherited from Element.)
GetMonitoredLinkElementIds
 Provides the link instance IDs when the element is monitoring.
 (Inherited from Element.)
GetMonitoredLocalElementIds
 Provides the local element IDs when the element is monitoring.
 (Inherited from Element.)
GetOrderedParameters
 Gets the parameters associated to the element in order.
 (Inherited from Element.)
GetOriginalGeometry
 Returns the original geometry of the instance, before the instance is modified by joins, cuts, coping, extensions, or other post-processing.
 (Inherited from FamilyInstance.)
GetParameterFormatOptions
 Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.
 (Inherited from Element.)
GetParameters
Retrieves the parameters from the element via the given name.
 (Inherited from Element.)
GetPhaseStatus
 Gets the status of a given element in the input phase
 (Inherited from Element.)
GetRefGridLines
 This method is used to get the reference gridlines.
GetSubComponentIds
Gets the sub component ElementIds of the current family instance.
 (Inherited from FamilyInstance.)
GetTotalTransform
 Gets the total transform, which includes the true north transform for instances like import instances.
 (Inherited from Instance.)
GetTransform
 Gets the transform of the instance.
 (Inherited from Instance.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetTypeId
 Returns the identifier of this element's type.
 (Inherited from Element.)
GetValidTypes()
 Obtains a set of types that are valid for this element.
 (Inherited from Element.)
HasPhases
 Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.
 (Inherited from Element.)
IsExternalFileReference
 Determines whether this Element represents an external file.
 (Inherited from Element.)
IsHidden
Identifies if the element has been permanently hidden in the view.
 (Inherited from Element.)
IsMonitoringLinkElement
 Indicate whether an element is monitoring any elements in any linked models.
 (Inherited from Element.)
IsMonitoringLocalElement
 Indicate whether an element is monitoring other local elements.
 (Inherited from Element.)
IsPhaseCreatedValid
 Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
 (Inherited from Element.)
IsPhaseDemolishedValid
 Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
 (Inherited from Element.)
IsValidType(ElementId)
 Checks if given type is valid for this element.
 (Inherited from Element.)
LookupParameter
Attempts to find a parameter on the element which has the given name.
 (Inherited from Element.)
RefersToExternalResourceReference
 Determines whether this Element uses external resources associated with a specified external resource type.
 (Inherited from Element.)
RefersToExternalResourceReferences
 Determines whether this Element uses external resources.
 (Inherited from Element.)
RemoveCoping
Removes a coping (cut) from a steel beam.
 (Inherited from FamilyInstance.)
rotate
The family instance will be flipped by 180 degrees. If it can not be rotated, return false, otherwise return true.
 (Inherited from FamilyInstance.)
SetCopingIds
Specifies the set of coping cutters on this element.
 (Inherited from FamilyInstance.)
SetEntity
 Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.
 (Inherited from Element.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
CanFlipFacing
Property to test whether the orientation of family instance facing can be flipped.
 (Inherited from FamilyInstance.)
CanFlipHand
Property to test whether the orientation of family instance hand can be flipped.
 (Inherited from FamilyInstance.)
CanFlipWorkPlane
Identifies if the instance can flip its work plane.
 (Inherited from FamilyInstance.)
CanRotate
Property to test whether the family instance can be rotated by 180 degrees.
 (Inherited from FamilyInstance.)
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
ExtensionUtility
Property to check whether the instance can be extended and return the interface for extension operation.
 (Inherited from FamilyInstance.)
FacingFlipped
Property to test whether the orientation of family instance facing is flipped.
 (Inherited from FamilyInstance.)
FacingOrientation
Property to get the orientation of family instance facing.
 (Inherited from FamilyInstance.)
FromRoom
The "From Room" set for the door or window in the last phase of the project.
 (Inherited from FamilyInstance.)
FromRoom[Phase] |  (Inherited from FamilyInstance.)
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
HandFlipped
Property to test whether the orientation of family instance hand is flipped.
 (Inherited from FamilyInstance.)
HandOrientation
Property to get the orientation of family instance hand.
 (Inherited from FamilyInstance.)
Host
If the instance is contained within another element, this property returns the containing element. An instance that is face hosted will return the element containing the face.
 (Inherited from FamilyInstance.)
HostFace
Property to get the reference to the host face of family instance.
 (Inherited from FamilyInstance.)
HostParameter
If the instance is hosted by a wall, this property returns the parameter value of the insertion point of the instance along the wall's location curve.
 (Inherited from FamilyInstance.)
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
Invisible
Property to test whether the family instance is invisible.
 (Inherited from FamilyInstance.)
IsSlantedColumn
 Indicates if the family instance is a slanted column.
 (Inherited from FamilyInstance.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
IsWorkPlaneFlipped
Identifies if the instance's work plane is flipped.
 (Inherited from FamilyInstance.)
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
Location
This property is used to find the physical location of an instance within project.
 (Inherited from FamilyInstance.)
Lockable
This property is used to know whether a panel can be locked.
MEPModel
Retrieves the MEP model for the family instance.
 (Inherited from FamilyInstance.)
Mirrored
Property to test whether the family instance is mirrored. (only one axis is flipped)
 (Inherited from FamilyInstance.)
Name
A human readable name for the Element.
 (Inherited from Element.)
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
PanelType
 The Panel style of this Panel.
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[String]
Retrieves a parameter from the element given its name.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
Room
The room in which the instance is located (during the last phase of the project).
 (Inherited from FamilyInstance.)
Room[Phase] |  (Inherited from FamilyInstance.)
Space
The space in which the instance is located (during the last phase of the project).
 (Inherited from FamilyInstance.)
Space[Phase] |  (Inherited from FamilyInstance.)
StructuralMaterialId
Identifies the material that defines the instance's structural analysis properties.
 (Inherited from FamilyInstance.)
StructuralMaterialType
This property returns the physical material from which the instance is made.
 (Inherited from FamilyInstance.)
StructuralType
Provides the primary structural type of the instance, such as beam or column etc.
 (Inherited from FamilyInstance.)
StructuralUsage
Provides the primary structural usage of the instance, such as brace, girder etc.
 (Inherited from FamilyInstance.)
SuperComponent
Property to get the super component of current family instance.
 (Inherited from FamilyInstance.)
Symbol
Returns or changes the FamilySymbol object that represents the type of the instance.
 (Inherited from FamilyInstance.)
ToRoom
The "To Room" set for the door or window in the last phase of the project.
 (Inherited from FamilyInstance.)
ToRoom[Phase] |  (Inherited from FamilyInstance.)
Transform
This property is used to find the transform of a curtain panel within project.
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
Panel Class
Autodesk.Revit.DB Namespace